{
    "FOOTER": {
        "INFO_DEVELOP1": "Designed und",
        "INFO_DEVELOP2": "entwickelt",
        "INFO_BY": "von Martin Zachoszcz"
    },
    "HOME": {
        "INTRO": {
            "TITLE": {
                "ZARTIN_FULL": "Zartin",
                "ZACHOSZCZ_FIRST_PART": "Z",
                "ZACHOSZCZ_LAST_PART": "achoszcz",
                "MARTIN_FIRST_PART": "M",
                "MARTIN_SECOND_PART": "artin",
                "GREETING": "Hi, ich bin",
                "INTRODUCTION_1": "Viele kennen mich auch als",
                "INTRODUCTION_2": "Ob Du mich Martin oder Zartin nennst, sei dir sicher, dass Du eine Mischung aus grundlegendem Wissen und bahnbrechender Innovation bekommst."
            }
        },
        "TEASER": {
            "TITLE": "Gemeinsam gestalten wir die Lösungen von morgen — heute.",
            "DESCRIPTION_1": "Dein Projekt ist mein Projekt: Ich biete umfassende Softwarelösungen mit einer",
            "DESCRIPTION_2": " Ethik. Als engagierter Problemlöser gehe ich Herausforderungen direkt an, um robuste, skalierbare Produkte zu kreieren. Lassen uns zusammenarbeiten und die Lösungen von morgen heute umsetzen.",
            "CUSTOMER_FIRST": " kundenorientierten "
        },
        "CARDS": {
            "craft": {
                "TITLE": "Expertise",
                "DESCRIPTION": "Tiefe Expertise in modernen Technologien und Entwicklungspraktiken",
                "ALT": "Fachkompetenz Kartenbild"
            },
            "feats": {
                "TITLE": "Erfolge",
                "DESCRIPTION": "Ausgewählte Erfolge, die meine Problemlösungsfähigkeiten und Hingabe unterstreichen",
                "ALT": "Erfolge Kartenbild"
            },
            "journey": {
                "TITLE": "Laufbahn",
                "DESCRIPTION": "Eine berufliche Laufbahn, die sich durch kontinuierliches Lernen und Anpassung auszeichnet",
                "ALT": "Laufbahn Kartenbild"
            },
            "contact": {
                "TITLE": "Kontakt",
                "DESCRIPTION": "Offene Kommunikationswege für zukünftige Zusammenarbeiten",
                "ALT": "Kontakt Kartenbild"
            }
        }
    },
    "CRAFT": {
        "TITLE": "Expertise",
        "DESCRIPTION": "Tiefe Expertise in modernen Technologien und Entwicklungspraktiken",
        "DESCRIPTION_LONG": "Tauchen Sie ein in mein Fachwissen und meine Methoden. Von kundenorientierter Entwicklung bis hin zu architektonischer Exzellenz, entdecken Sie die Dienstleistungen und Ansätze, die meine Arbeit prägen und herausragende Ergebnisse liefern.",
        "TECHNOLOGIES": "Technologien mit denen ich gearbeitet habe",
        "MANIFESTO_TITLE": "Mein technisches Handwerk",
        "MANIFESTO": {
            "client": {
                "TITLE": "Kundenorientierte Schnellentwicklung",
                "DESCRIPTION": "In der heutigen schnelllebigen Welt ist es entscheidend, die Anforderungen der Kunden zu verstehen und sich schnell anzupassen. Ich priorisiere direkte Kommunikation und iterative Entwicklung. Das bedeutet weniger Zeit für das Entschlüsseln von Bedürfnissen und mehr Zeit für maßgeschneiderte Lösungen.",
                "TOOLS": "Echtzeit-Kollaborationstools (z.B., Slack, Trello) um Kunden auf dem Laufenden zu halten.",
                "ALT": "kundenorientiertes Kartenbild"
            },
            "technical": {
                "TITLE": "Umfassende Technische Dienstleistungen",
                "DESCRIPTION": "Ob es darum geht, pixelgenaue Frontends zu erstellen, robuste Backends, CI/CD-Pipelines zu optimieren oder Expertenberatung zu bieten, ich biete ein umfassendes Dienstleistungsangebot. Lassen Sie uns Ihre Vision von Konzept bis Einsatz verwirklichen.",
                "TOOLS": "Frontend (React, Vue, SASS), Backend (Node.js, Express, MongoDB), CI/CD (Jenkins, GitHub Actions), und Beratungssitzungen über Zoom oder Teams.",
                "ALT": "Technische Dienstleistungen Kartenbild"
            },
            "aws": {
                "TITLE": "Architektonische Exzellenz mit Cloud-Kompetenz",
                "DESCRIPTION": "Mit einer zertifizierten Kompetenz in AWS zeichne ich mich durch das Entwerfen von widerstandsfähigen, skalierbaren und effizienten Softwarearchitekturen aus. Von robusten Mikrodiensten bis hin zu cloud-nativen Lösungen stelle ich sicher, dass Ihre Software nicht nur aktuellen Anforderungen gerecht wird, sondern auch zukunftssicher ist.",
                "TOOLS": "AWS (Lambda, EC2, S3, etc.), Docker, Serverless Framework, Terraform.",
                "ALT": "Architektonisches Kartenbild"
            },
            "codequality": {
                "TITLE": "Ganzheitliche Code-Qualität",
                "DESCRIPTION": "Über einfach nur \"funktionierenden\" Code hinaus konzentriere ich mich auf Klarheit, Wartbarkeit und die Vorwegnahme von unbekannten Randbedingungen. Während testgetriebene Entwicklung (TDD) wertvoll ist, betone ich ganzheitliche Code-Qualität - sicherstellend, dass jede Zeile zweckmäßig, getestet und zum größeren Software-Vision beiträgt.",
                "TOOLS": "ESLint, Prettier, Jest, Mocha, Chai.",
                "ALT": "Code-Qualität Kartenbild"
            }
        }
    },
    "CONTACT": {
        "TITLE": "Kontakt",
        "DESCRIPTION_LONG": "Hast du eine Idee, eine Frage oder willst einfach nur Hallo sagen? So kannst du direkt Kontakt mit mir aufnehmen. Ob Projektgespräche, technische Beratung oder einfach nur technischer Klatsch, meine virtuelle Tür ist immer offen.",
        "DESCRIPTION": "Offene Kommunikationskanäle für zukünftige Zusammenarbeiten",
        "WELCOME": "Sag Hallo 👋",
        "THANKS": "Danke für Deine Nachricht!",
        "THANKS2": "Wir werden uns schnellstmöglichst bei Dir melden",
        "ERROR": "Etwas ist schief gelaufen",
        "ERROR2": "Bitte versuche es später nochmal oder kontaktiere uns direkt an contact@zartin.dev",
        "FORM": {
            "BUTTON": "Absenden",
            "FIELDS": {
                "NAME": {
                    "VALUE": "Name",
                    "ERROR": "Name ist erforderlich"
                },
                "EMAIL": {
                    "VALUE": "Email",
                    "ERROR": "Bitte überprüfe die Email"
                },
                "SUBJECT": {
                    "VALUE": "Betreff",
                    "ERROR": "Betreff ist erforderlich"
                },
                "MESSAGE": {
                    "VALUE": "Nachricht",
                    "ERROR": "Nachricht ist erforderlich"
                }
            }
        }
    },
    "FEATS": {
        "TITLE": "Erfolge",
        "DESCRIPTION_LONG": "Tiefer Einblick in meinen beruflichen Werdegang: Von der Architektur digitaler Lösungen, die modernste Anwendungen antrieben, über das Mentoring der Technik-Innovatoren von morgen bis hin zur Führung von wirkungsvollen Projektrealisierungen. Erlebe die Mischung aus Strategie, Umsetzung und Leidenschaft, die meine Arbeit antreibt.",
        "DESCRIPTION": "Ausgewählte Erfolge, die meine Problemlösungsfähigkeiten und Hingabe unterstreichen",
        "FEATS": [
            {
                "TITLE_PREFIX": "Berufserfahrung:",
                "TITLE": "'Das Fundament meiner Expertise'",
                "DESCRIPTION": "Meine Zeit bei CARIAD war geprägt von einem intensiven Eintauchen in Web-Technologien, wo ich die entscheidende Rolle beim Verteilen von Software an zahlreiche Fahrzeuge weltweit hatte.",
                "SLIDES": [
                    {
                        "TITLE": "SDK-Betreuer",
                        "DESCRIPTION": "Während meiner Zeit bei CARIAD hatten mein Team und ich die Verantwortung für ein weitreichendes SDK mit verschiedenen Bibliotheken, spezialisierten Build-Tools, dynamischen Anwendungen, topaktueller Dokumentation und konstanten Support-Mechanismen, um andere Teams im Software-Ökosystem zu unterstützen."
                    },
                    {
                        "TITLE": "Bibliotheken",
                        "DESCRIPTION": "Initiierte die Erstellung und Verwaltung vielfältiger Bibliotheken. Dazu gehörten White-Label-UI-Bibliotheken mit thematischer Dynamik, benutzerdefinierte Kommunikationsprotokolle und abstrakte Funktionen für spezialisierte Fahrzeugfunktionen."
                    },
                    {
                        "TITLE": "Build-Tools",
                        "DESCRIPTION": "Förderung der Entwicklung erweiterter Extensions für das Angular CLI, speziell abgestimmt auf die Eigenheiten des Infotainment-Systemumfelds."
                    },
                    {
                        "TITLE": "Anwendungen",
                        "DESCRIPTION": "Bereitstellung einer umfassenden Suite von Desktop-Anwendungen mit Überwachungs-, Debugging-, Analyse- und Testfunktionen, um einen reibungslosen Entwicklungs- und Integrationsprozess zu gewährleisten."
                    },
                    {
                        "TITLE": "Umfassende Dokumentation",
                        "DESCRIPTION": "Einführung eines fortschrittlichen Dokumentationsmodells mit Funktionen wie Auto-Generierung und Auto-Deployment, unterstützt durch unsere maßgeschneiderte CD/CI-Pipeline, um Entwicklern einen nahtlosen Zugriff und Updates zu ermöglichen."
                    },
                    {
                        "TITLE": "Support für andere Teams",
                        "DESCRIPTION": "Aufbau eines zentralen Expertisezentrums, das kontinuierliche Unterstützung für verschiedene interne Teams und externe Partner bietet. Von Workshops über Debugging-Sitzungen bis hin zu E-Mail-Support schufen wir ein ganzheitliches Umfeld für Wissensaustausch und Problemlösung."
                    }
                ]
            },
            {
                "TITLE_PREFIX": "Bildner & Kollaborateur:",
                "TITLE": "'Die nächste Tech-Avantgarde formen'",
                "DESCRIPTION": "Durch das Kombinieren von psychologischem Verständnis mit technischer Expertise bin ich über das Codieren hinausgegangen. Ich war sowohl ein Wegweiser für Teams als auch ein Mentor für zukünftige Tech-Leader und sorgte dafür, dass sie mit einer menschlichen Note branchenbereit sind.",
                "SLIDES": [
                    {
                        "TITLE": "Benjamin Dobler",
                        "DESCRIPTION": "\"Ich hatte das Privileg, mit Zartin sowohl Arbeitsstationen als auch Lacher zu teilen. Neben seinem technischen Genie war er immer der menschliche Anker in jedem Projekt. Echt, herzlich und ein Fels in stürmischen Zeiten. Ich fand nicht nur einen Kollegen, sondern einen Freund.\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/richapps/",
                        "ROLE": "Projektleiter Web-Entwicklung"
                    },
                    {
                        "TITLE": "Thomas Volk",
                        "DESCRIPTION": "\"Komplexe Projekte werden mit Zartin an deiner Seite zehnmal einfacher. Sein unerschütterliches Engagement, seine scharfen Einsichten und sein unermüdliches Problemlösen machten das Unmögliche möglich. Ich verdanke ihm einen Großteil des Erfolgs unseres Projekts.\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/thvolk/",
                        "ROLE": "Leiter der Technikabteilung"
                    },
                    {
                        "TITLE": "Vladyslav Tsurkanenko",
                        "DESCRIPTION": "\"Martin inspirierte mich dazu, die Begeisterung am Programmieren zu finden und Programmierherausforderungen mit demselben Fokus wie er zu meistern. Ich bin ihm wirklich dankbar für seine Geduld und Unterstützung während meines Studiums!\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/vladyslav-tsurkanenko/",
                        "ROLE": "Webentwickler (ehemaliger Student)"
                    }
                ]
            },
            {
                "TITLE_PREFIX": "Hervorgehobenes Projekt:",
                "TITLE": "'Neugestaltung der digitalen Präsenz der Spiced Academy'",
                "DESCRIPTION": "Ich habe eine komplette Transformation der digitalen Präsenz der Spiced Academy durchgeführt, wobei ich meinen Einsatz für überlegenes Design, Funktionalität und Benutzererfahrung betonte. Die Anpassungsfähigkeit und Konsistenz der Plattform setzte neue Maßstäbe.",
                "SLIDES": [
                    {
                        "TITLE": "Technische Modernisierung",
                        "DESCRIPTION": "Der Übergang von veralteten Technologiestapeln erfordert gründliche Analysen, Risikominderung und strategische Implementierung. Der erfolgreiche Umzug von Handlebars und JQuery zu einem modernen Ensemble aus NextJS, Tailwind und GraphQL schuf eine robuste Plattform, die für erweiterte Funktionalitäten und zukünftige Skalierbarkeit geeignet ist."
                    },
                    {
                        "TITLE": "Evolution des Content-Management",
                        "DESCRIPTION": "Um die Inhaltsagilität und -anpassungsfähigkeit der Akademie zu erhöhen, integrierte ich ein CMS. Dies ermöglicht es Content-Administratoren, Inhalte der Website dynamisch anzupassen und zu aktualisieren und bietet so eine konsistente und aktuelle Benutzererfahrung ohne Abhängigkeit von Entwicklungszyklen."
                    },
                    {
                        "TITLE": "Implementierung von Responsive & Scalable Design",
                        "DESCRIPTION": "Einführung eines schlanken, responsiven Designs, das auf allen Geräten eine konsistente Benutzererfahrung bietet. Dieses Design wurde mit Entwicklern im Hinterkopf erstellt und ermöglicht eine einfache Skalierbarkeit und mühelose zukünftige Verbesserungen."
                    },
                    {
                        "TITLE": "Leistung und SEO-Optimierung",
                        "DESCRIPTION": "Ein Hauptmaß für den Erfolg einer Website ist ihre Leistung und Sichtbarkeit. Nach der Überarbeitung wurden sorgfältige Optimierungsstrategien eingesetzt, was zu verbesserten Reaktionszeiten der Seite und SEO-Metriken führte. Dies stellt sicher, dass die Spiced Academy optimal in den Suchmaschinenrankings positioniert ist, was den organischen Traffic steigert und die Benutzerbindung erhöht."
                    },
                    {
                        "TITLE": "Verbesserte Entwicklererfahrung",
                        "DESCRIPTION": "In Erwartung zukünftiger Entwicklungsbedürfnisse konzentrierte sich die Überarbeitung auf die Verbesserung der Entwicklererfahrung. Dies beinhaltete die Verfeinerung der Codierungsumgebung, sorgfältige Dokumentation und den Aufbau von optimierten Arbeitsabläufen, die eine nahtlose zukünftige Entwicklung und Feature-Integration ermöglichen."
                    }
                ]
            }
        ]
    },
    "JOURNEY": {
        "TITLE": "Laufbahn",
        "DESCRIPTION_LONG": "Durchquere die Zeitleiste meines beruflichen Lebens. Von bescheidenen Anfängen bis zu bedeutenden Meilensteinen, erlebe die Entwicklung eines Codierers zum Technikexperten. Dieser Abschnitt gibt Einblick in die Erfahrungen, Herausforderungen und Erkenntnisse, die meine Reise in der sich ständig weiterentwickelnden Technikwelt geprägt haben.",
        "DESCRIPTION": "Eine berufliche Laufbahn, die sich durch kontinuierliches Lernen und Anpassungsfähigkeit auszeichnet",
        "STATIONS": [
            {
                "DATE": "1987",
                "EVENT": "Geboren in Berlin",
                "DESCRIPTION": "Geboren und aufgewachsen im pulsierenden Berlin, begann meine Reise inmitten seiner reichen Geschichte und belebten Straßen."
            },
            {
                "DATE": "2008",
                "EVENT": "Abitur",
                "DESCRIPTION": "Meine Schulzeit zeigte eine frühe Leidenschaft für Zahlen, Naturwissenschaften und logische Herausforderungen. Von der Grundschule bis zum Gymnasium vertiefte sich meine Neugier nur noch mehr."
            },
            {
                "DATE": "2008-2010",
                "EVENT": "Datentechnologie bei Siemens Professional Education",
                "DESCRIPTION": "Ich tauchte tief in die Welt der Informatik ein und erkundete ein Spektrum von Themen. Diese Zeit war gefüllt mit praktischen Projekten, Praktika und unschätzbaren Lektionen, die mein grundlegendes Verständnis des Fachgebiets formten."
            },
            {
                "DATE": "2011-2014",
                "EVENT": "Bachelor in Psychologie",
                "DESCRIPTION": "In einer überraschenden Wendung verfolgte ich einen Bachelor in Psychologie. Diese Reise, obwohl scheinbar abseits der Tech-Spur, rüstete mich mit einzigartigen Perspektiven und Einsichten aus, die seitdem meine Tech-Bestrebungen beeinflusst haben."
            },
            {
                "DATE": "2014-2017",
                "EVENT": "Master in Human Factors",
                "DESCRIPTION": "Mit dem Wunsch, mein Wissen in Psychologie und Technik zu verknüpfen, nahm ich am interdisziplinären Programm \"Master in Human Factors\" teil. Hier kehrte ich in die Tech-Welt zurück und kombinierte psychologische Prinzipien mit Ingenieurmodulen. Diese einzigartige Mischung, die die menschliche Psyche mit Tech-Prinzipien verschmilzt, hat mich mit einem besonderen Vorteil im Bereich der Softwareentwicklung ausgestattet."
            },
            {
                "DATE": "2016 - 2022",
                "EVENT": "Web-Entwickler bei CARIAD SE (ehemals Carmeq GmbH)",
                "DESCRIPTION": "In dieser Zeit tauchte ich tief in den weiten Ozean der Webentwicklung ein. Obwohl ich immer einen Berührungspunkt mit der Programmierung hatte, war es hier, wo ich die Welt der WEBENTWICKLUNG wirklich umarmte. Als Teil eines Kernteams bauten und pflegten wir ein SDK für Infotainment-Systeme in Autos bekannter Marken wie VW, Skoda, SEAT und MAN. Mehr als nur Werkzeuge zu schaffen, waren wir das vitale Nexus, das Teams unterstützte und sicherstellte, dass ihre Apps nahtlos liefen."
            },
            {
                "DATE": "2022 und darüber hinaus",
                "EVENT": "Freelancing Odyssey",
                "DESCRIPTION": "Nach einem halben Jahrzehnt bei CARIAD rief mich das Locklied verschiedener Projekte und unterschiedlicher Technologien. Jetzt, als Freiberufler, biete ich nicht nur technische Fähigkeiten an. Ich bringe eine Mischung aus Leidenschaft, Hingabe und einer einzigartigen Perspektive in jedes Projekt ein und behandle jedes als persönliche Mission."
            }
        ]
    }
}