{
    "HOME": {
        "INTRO": {
            "TITLE": {
                "ZARTIN_FULL": "Zartin",
                "ZACHOSZCZ_FIRST_PART": "Z",
                "ZACHOSZCZ_LAST_PART": "achoszcz",
                "MARTIN_FIRST_PART": "M",
                "MARTIN_SECOND_PART": "artin",
                "GREETING": "Hi, ich bin",
                "INTRODUCTION_1": "Viele kennen mich auch als",
                "INTRODUCTION_2": "Ob Du mich Martin oder Zartin nennst, sei dir sicher, dass Du eine Mischung aus grundlegendem Wissen und bahnbrechender Innovation bekommst."
            }
        },
        "TEASER": {
            "TITLE": "Gemeinsam bauen wir die Lösungen von morgen — heute.",
            "DESCRIPTION_1": "Dein Projekt ist mein Projekt: Ich liefere umfassende Softwarelösungen mit einer",
            "DESCRIPTION_2": " Ethik. Als engagierter Problemlöser stelle ich mich Herausforderungen direkt, um robuste, skalierbare Produkte zu schaffen. Lass uns zusammenarbeiten und die Lösungen von morgen bauen — heute.",
            "CUSTOMER_FIRST": " kundenorientierten "
        },
        "CARDS": {
            "craft": {
                "TITLE": "Fachkompetenz",
                "DESCRIPTION": "Tiefgreifende Expertise in modernen Technologien und Entwicklungspraktiken",
                "ALT": "Fachkompetenz Kartenbild"
            },
            "feats": {
                "TITLE": "Erfolge",
                "DESCRIPTION": "Ausgewählte Erfolge, die meine Problemlösungsfähigkeiten und Hingabe unterstreichen",
                "ALT": "Erfolge Kartenbild"
            },
            "journey": {
                "TITLE": "Laufbahn",
                "DESCRIPTION": "Eine berufliche Laufbahn, die sich durch kontinuierliches Lernen und Anpassungsfähigkeit auszeichnet",
                "ALT": "Laufbahn Kartenbild"
            },
            "contact": {
                "TITLE": "Kontakt",
                "DESCRIPTION": "Offene Kommunikationskanäle für zukünftige Zusammenarbeiten",
                "ALT": "Kontakt Kartenbild"
            }
        }
    },
    "CRAFT": {
        "TITLE": "Fachkompetenz",
        "DESCRIPTION": "Tiefgreifende Expertise in modernen Technologien und Entwicklungspraktiken",
        "DESCRIPTION_LONG": "Tauchen Sie ein in die Grundpfeiler meines Handwerks - die Methoden und Praktiken, die ich befolge. In diesem Abschnitt entdecken Sie nicht nur die Dienstleistungen, die ich anbiete, sondern auch den philosophischen Ansatz, den ich verfolge. Von der Priorisierung direkter Kommunikation mit Kunden bis zur Sicherstellung zukunftssicherer Softwaregestaltung verbinde ich Fachwissen mit Empathie und sorge dafür, dass jedes Projekt ein maßgeschneidertes Meisterwerk ist.",
        "MANIFESTO": {
            "client": {
                "TITLE": "Client-Centric Rapid Development",
                "DESCRIPTION": "In today’s fast-paced world, understanding client requirements and adapting quickly is key. I prioritize direct communication and iterative development. This means less time deciphering needs and more time building solutions tailored to you.",
                "TOOLS": "Real-time collaboration tools (e.g., Slack, Trello) for keeping clients in the loop.",
                "ALT": "client-centric card image"
            },
            "technical": {
                "TITLE": "Comprehensive Technical Services",
                "DESCRIPTION": "Whether it's crafting pixel-perfect frontends, robust backends, streamlining CI/CD pipelines, or providing expert consultancy, I offer a comprehensive suite of services. Let's make your vision a reality, from concept to deployment.",
                "TOOLS": "Frontend (React, Vue, SASS), Backend (Node.js, Express, MongoDB), CI/CD (Jenkins, GitHub Actions), and Consultation sessions via Zoom or Teams.",
                "ALT": "Technical services card image"
            },
            "aws": {
                "TITLE": "Architectural Excellence with Cloud Expertise",
                "DESCRIPTION": "With a certified proficiency in AWS, I pride myself on designing resilient, scalable, and efficient software architectures. From designing robust microservices to leveraging cloud-native solutions, I ensure your software not only meets current demands but is future-proof.",
                "TOOLS": "AWS (Lambda, EC2, S3, etc.), Docker, Serverless Framework, Terraform.",
                "ALT": "Architectural card image"
            },
            "codequality": {
                "TITLE": "Holistic Code Quality",
                "DESCRIPTION": "Beyond just \"working\" code, I focus on clarity, maintainability, and anticipating unseen edge cases. While Test-Driven Development (TDD) is valuable, I emphasize holistic code quality—ensuring each line is purposeful, tested, and contributes to the larger software vision.",
                "TOOLS": "ESLint, Prettier, Jest, Mocha, Chai.",
                "ALT": "code quality card image"
            }
        }
    },
    "CONTACT": {
        "TITLE": "Kontakt",
        "DESCRIPTION_LONG": "Haben Sie eine Idee, eine Frage oder möchten Sie einfach nur Hallo sagen? Dies ist Ihr Portal, um direkt mit mir in Kontakt zu treten. Sei es für Projektbesprechungen, technische Beratungen oder einfach nur etwas Technik-Geplauder, meine virtuelle Tür steht immer offen und wartet darauf, Verbindungen und Kollaborationen zu fördern.",
        "DESCRIPTION": "Offene Kommunikationskanäle für zukünftige Zusammenarbeiten"
    },
    "FEATS": {
        "TITLE": "Erfolge",
        "DESCRIPTION_LONG": "Betreten Sie eine Galerie meiner beruflichen Errungenschaften. Hier finden Sie eine sorgfältig ausgewählte Sammlung von Projekten aus verschiedenen Bereichen und Herausforderungen. Jedes Unterfangen erzählt eine Geschichte von Hingabe, Können und dem unermüdlichen Streben nach Exzellenz und vermittelt einen Eindruck davon, was ich zu bieten habe.",
        "DESCRIPTION": "Ausgewählte Erfolge, die meine Problemlösungsfähigkeiten und Hingabe unterstreichen",
        "FEATS": [
            {
                "TITLE": "Professional Experience: 'The Foundation of My Expertise'",
                "DESCRIPTION": "At CARIAD, the digital frontier of the Volkswagen Group, my role transcended traditional software engineering. I was intrinsically involved in crafting and overseeing an expansive SDK that became the bedrock for every web application on the infotainment systems of Volkswagen, Skoda, and Seat vehicles. Partnered with a compact, agile team, we ensured that both in-house teams and third-party suppliers had the tools and knowledge to seamlessly integrate and innovate.",
                "SLIDES": [
                    {
                        "TITLE": "1",
                        "DESCRIPTION": "UI LIbrary, communication protocol, car-functionalities"
                    },
                    {
                        "TITLE": "2",
                        "DESCRIPTION": "Extending the Angular CLI"
                    },
                    {
                        "TITLE": "3",
                        "DESCRIPTION": "UI LIbrary, communication protocol, car-functionalities"
                    },
                    {
                        "TITLE": "4",
                        "DESCRIPTION": "Extending the Angular CLI"
                    }
                ]
            },
            {
                "TITLE": "Educator & Collaborator: 'Shaping the Next Tech Vanguard'",
                "DESCRIPTION": "Throughout my career, I've not just been a developer but also a mentor, a teacher, and a collaborator. At CARIAD, I led workshops and debugging sessions, aiding teams in harnessing the SDK's full potential. My stint at Spiced Academy further solidified this role, where I actively shaped and delivered curriculum changes, guiding students to become industry-ready.",
                "SLIDES": [
                    {
                        "TITLE": "Vlad",
                        "DESCRIPTION": "Web Developer (former student)",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/vladyslav-tsurkanenko/",
                        "TESTIMONIAL": "Best Coach"
                    },
                    {
                        "TITLE": "Benz",
                        "DESCRIPTION": "Lead Software Engineer at CARIAD",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/richapps/",
                        "TESTIMONIAL": "Bester Mann"
                    }
                ]
            },
            {
                "TITLE": "Featured Project: 'Revamping Spiced Academy's Digital Presence'",
                "DESCRIPTION": "My recent solo endeavor involved a complete overhaul of Spiced Academy's website. A synthesis of modern tech stacks like NextJS, TypeScript, Tailwind CSS, and GraphQL, the project underscored my commitment to design, functionality, and user experience. With content managed through Contentful CMS, the site became a dynamic blend of adaptability and consistency.",
                "SLIDES": [
                    {
                        "TITLE": "CMS",
                        "DESCRIPTION": "Content can be changed"
                    },
                    {
                        "TITLE": "New Techstack",
                        "DESCRIPTION": "Technologies like NextJS, TailwindCSS and Contentful"
                    },
                    {
                        "TITLE": "CMS",
                        "DESCRIPTION": "Content can be changed"
                    },
                    {
                        "TITLE": "New Techstack",
                        "DESCRIPTION": "Technologies like NextJS, TailwindCSS and Contentful"
                    }
                ]
            }
        ]
    },
    "JOURNEY": {
        "TITLE": "Laufbahn",
        "DESCRIPTION_LONG": "Durchqueren Sie die Zeitleiste meines beruflichen Lebens. Von bescheidenen Anfängen bis zu bedeutenden Meilensteinen erleben Sie die Entwicklung eines Codierers, der zum Technikexperten wurde. Dieser Abschnitt gibt Einblick in die Erfahrungen, Herausforderungen und Erkenntnisse, die meine Reise in der sich ständig weiterentwickelnden Techniklandschaft geprägt haben.",
        "DESCRIPTION": "Eine berufliche Laufbahn, die sich durch kontinuierliches Lernen und Anpassungsfähigkeit auszeichnet"
    }
}