{
    "HOME": {
        "INTRO": {
            "TITLE": {
                "ZARTIN_FULL": "Zartin",
                "ZACHOSZCZ_FIRST_PART": "Z",
                "ZACHOSZCZ_LAST_PART": "achoszcz",
                "MARTIN_FIRST_PART": "M",
                "MARTIN_SECOND_PART": "artin",
                "GREETING": "Hi, I'm",
                "INTRODUCTION_1": "Though many know me as",
                "INTRODUCTION_2": "Whether you call me Martin or Zartin, know that you're getting a blend of foundational knowledge and cutting-edge innovation."
            }
        },
        "TEASER": {
            "TITLE": "Building Tomorrow's Solutions Together — Today.",
            "DESCRIPTION_1": "Your project is my project: I deliver comprehensive software solutions with a",
            "DESCRIPTION_2": "ethos. As a dedicated problem-solver, I tackle challenges head-on to create robust, scalable products. Let's collaborate and build tomorrow's solutions—today.",
            "CUSTOMER_FIRST": " customer-first "
        },
        "CARDS": {
            "craft": {
                "TITLE": "Craft",
                "DESCRIPTION": "In-depth expertise in modern technologies and development practices",
                "ALT": "Craft card image"
            },
            "feats": {
                "TITLE": "Feats",
                "DESCRIPTION": "Selected achievements that exemplify my problem-solving skills and dedication",
                "ALT": "Feats card image"
            },
            "journey": {
                "TITLE": "Journey",
                "DESCRIPTION": "A professional trajectory characterized by continuous learning and adaptability",
                "ALT": "Journey card image"
            },
            "contact": {
                "TITLE": "Contact",
                "DESCRIPTION": "Open channels for communication and future collaborations",
                "ALT": "Contact card image"
            }
        }
    },
    "CRAFT": {
        "TITLE": "Craft",
        "DESCRIPTION": "In-depth expertise in modern technologies and development practices",
        "DESCRIPTION_LONG": "Dive into my expertise and methodologies. From client-centric development to architectural excellence, discover the services and approaches that shape my work and deliver outstanding results.",
        "MANIFESTO": {
            "client": {
                "TITLE": "Client-Centric Rapid Development",
                "DESCRIPTION": "In today’s fast-paced world, understanding client requirements and adapting quickly is key. I prioritize direct communication and iterative development. This means less time deciphering needs and more time building solutions tailored to you.",
                "TOOLS": "Real-time collaboration tools (e.g., Slack, Trello) for keeping clients in the loop.",
                "ALT": "client-centric card image"
            },
            "technical": {
                "TITLE": "Comprehensive Technical Services",
                "DESCRIPTION": "Whether it's crafting pixel-perfect frontends, robust backends, streamlining CI/CD pipelines, or providing expert consultancy, I offer a comprehensive suite of services. Let's make your vision a reality, from concept to deployment.",
                "TOOLS": "Frontend (React, Vue, SASS), Backend (Node.js, Express, MongoDB), CI/CD (Jenkins, GitHub Actions), and Consultation sessions via Zoom or Teams.",
                "ALT": "Technical services card image"
            },
            "aws": {
                "TITLE": "Architectural Excellence with Cloud Expertise",
                "DESCRIPTION": "With a certified proficiency in AWS, I pride myself on designing resilient, scalable, and efficient software architectures. From designing robust microservices to leveraging cloud-native solutions, I ensure your software not only meets current demands but is future-proof.",
                "TOOLS": "AWS (Lambda, EC2, S3, etc.), Docker, Serverless Framework, Terraform.",
                "ALT": "Architectural card image"
            },
            "codequality": {
                "TITLE": "Holistic Code Quality",
                "DESCRIPTION": "Beyond just \"working\" code, I focus on clarity, maintainability, and anticipating unseen edge cases. While Test-Driven Development (TDD) is valuable, I emphasize holistic code quality—ensuring each line is purposeful, tested, and contributes to the larger software vision.",
                "TOOLS": "ESLint, Prettier, Jest, Mocha, Chai.",
                "ALT": "code quality card image"
            }
        }
    },
    "CONTACT": {
        "TITLE": "Contact",
        "DESCRIPTION_LONG": "Have an idea, a query, or just want to say hi? This is how to connect with me directly. Be it project discussions, technical consultations, or just some tech banter, my virtual door is always open.",
        "DESCRIPTION": "Open channels for communication and future collaborations"
    },
    "FEATS": {
        "TITLE": "Feats",
        "DESCRIPTION_LONG": "Browse my collection of past projects and contributions. From straightforward solutions to more complex endeavors, see the practical outcomes and the methods that have defined each piece of my work.",
        "DESCRIPTION": "Selected achievements that exemplify my problem-solving skills and dedication"
    },
    "JOURNEY": {
        "TITLE": "Journey",
        "DESCRIPTION_LONG": "Embark on a journey through the landmarks of my career. From my earliest coding adventures to mastering advanced tech realms, see the evolution, the challenges, and the triumphs that have shaped my path.",
        "DESCRIPTION": "A professional trajectory characterized by continuous learning and adaptability"
    }
}