{
    "FOOTER": {
        "INFO_DEVELOP1": "Designed and",
        "INFO_DEVELOP2": "developed",
        "INFO_BY": "by Martin Zachoszcz"
    },
    "HOME": {
        "INTRO": {
            "TITLE": {
                "ZARTIN_FULL": "Zartin",
                "ZACHOSZCZ_FIRST_PART": "Z",
                "ZACHOSZCZ_LAST_PART": "achoszcz",
                "MARTIN_FIRST_PART": "M",
                "MARTIN_SECOND_PART": "artin",
                "GREETING": "Hi, I'm",
                "INTRODUCTION_1": "Though many know me as",
                "INTRODUCTION_2": "Whether you call me Martin or Zartin, know that you're getting a blend of foundational knowledge and cutting-edge innovation."
            }
        },
        "TEASER": {
            "TITLE": "Building Tomorrow's Solutions Together — Today.",
            "DESCRIPTION_1": "Your project is my project: I deliver comprehensive software solutions with a",
            "DESCRIPTION_2": "ethos. As a dedicated problem-solver, I tackle challenges head-on to create robust, scalable products. Let's collaborate and build tomorrow's solutions—today.",
            "CUSTOMER_FIRST": " customer-first "
        },
        "CARDS": {
            "craft": {
                "TITLE": "Craft",
                "DESCRIPTION": "In-depth expertise in modern technologies and development practices",
                "ALT": "Craft card image"
            },
            "feats": {
                "TITLE": "Feats",
                "DESCRIPTION": "Selected achievements that exemplify my problem-solving skills and dedication",
                "ALT": "Feats card image"
            },
            "journey": {
                "TITLE": "Journey",
                "DESCRIPTION": "A professional trajectory characterized by continuous learning and adaptability",
                "ALT": "Journey card image"
            },
            "contact": {
                "TITLE": "Contact",
                "DESCRIPTION": "Open channels for communication and future collaborations",
                "ALT": "Contact card image"
            }
        }
    },
    "CRAFT": {
        "TITLE": "Craft",
        "DESCRIPTION": "In-depth expertise in modern technologies and development practices",
        "DESCRIPTION_LONG": "Dive into my expertise and methodologies. From client-centric development to architectural excellence, discover the services and approaches that shape my work and deliver outstanding results.",
        "TECHNOLOGIES": "Technologies I have worked with",
        "MANIFESTO_TITLE": "My Technical Manifesto",
        "MANIFESTO": {
            "client": {
                "TITLE": "Client-Centric Rapid Development",
                "DESCRIPTION": "In today’s fast-paced world, understanding client requirements and adapting quickly is key. I prioritize direct communication and iterative development. This means less time deciphering needs and more time building solutions tailored to you.",
                "TOOLS": "Real-time collaboration tools (e.g., Slack, Trello) for keeping clients in the loop.",
                "ALT": "client-centric card image"
            },
            "technical": {
                "TITLE": "Comprehensive Technical Services",
                "DESCRIPTION": "Whether it's crafting pixel-perfect frontends, robust backends, streamlining CI/CD pipelines, or providing expert consultancy, I offer a comprehensive suite of services. Let's make your vision a reality, from concept to deployment.",
                "TOOLS": "Frontend (React, Vue, SASS), Backend (Node.js, Express, MongoDB), CI/CD (Jenkins, GitHub Actions), and Consultation sessions via Zoom or Teams.",
                "ALT": "Technical services card image"
            },
            "aws": {
                "TITLE": "Architectural Excellence with Cloud Expertise",
                "DESCRIPTION": "With a certified proficiency in AWS, I pride myself on designing resilient, scalable, and efficient software architectures. From designing robust microservices to leveraging cloud-native solutions, I ensure your software not only meets current demands but is future-proof.",
                "TOOLS": "AWS (Lambda, EC2, S3, etc.), Docker, Serverless Framework, Terraform.",
                "ALT": "Architectural card image"
            },
            "codequality": {
                "TITLE": "Holistic Code Quality",
                "DESCRIPTION": "Beyond just \"working\" code, I focus on clarity, maintainability, and anticipating unseen edge cases. While Test-Driven Development (TDD) is valuable, I emphasize holistic code quality—ensuring each line is purposeful, tested, and contributes to the larger software vision.",
                "TOOLS": "ESLint, Prettier, Jest, Mocha, Chai.",
                "ALT": "code quality card image"
            }
        }
    },
    "CONTACT": {
        "TITLE": "Contact",
        "DESCRIPTION_LONG": "Have an idea, a query, or just want to say hi? This is how to connect with me directly. Be it project discussions, technical consultations, or just some tech banter, my virtual door is always open.",
        "DESCRIPTION": "Open channels for communication and future collaborations",
        "WELCOME": "Say Hi 👋",
        "THANKS": "Thanks for your message!",
        "THANKS2": "We will answer shortly",
        "FORM": {
            "BUTTON": "Send",
            "FIELDS": {
                "NAME": {
                    "VALUE": "Name",
                    "ERROR": "Name is required"
                },
                "EMAIL": {
                    "VALUE": "Email",
                    "ERROR": "Please provide a valid email address"
                },
                "SUBJECT": {
                    "VALUE": "Subject",
                    "ERROR": "Subject is required"
                },
                "MESSAGE": {
                    "VALUE": "Message",
                    "ERROR": "Message is required"
                }
            }
        }
    },
    "FEATS": {
        "TITLE": "Feats",
        "DESCRIPTION_LONG": "Dive deep into my professional trajectory: From architecting digital solutions that powered cutting-edge applications, mentoring the tech innovators of tomorrow, to spearheading impactful project realizations. Witness the blend of strategy, execution, and passion that drive my work.",
        "DESCRIPTION": "Selected achievements that exemplify my problem-solving skills and dedication",
        "FEATS": [
            {
                "TITLE_PREFIX": "Professional Experience:",
                "TITLE": "'The Foundation of My Expertise'",
                "DESCRIPTION": "My journey at CARIAD was marked by a deep dive into the vast expanse of web technologies, where I was entrusted with the pivotal role of dispatching software to a multitude of vehicles worldwide.",
                "SLIDES": [
                    {
                        "TITLE": "SDK Maintainer",
                        "DESCRIPTION": "In my tenure at CARIAD, my team and I owned the stewardship of an expansive SDK comprising a variety of libraries, specialized build tools, dynamic applications, cutting-edge documentation, and consistent support mechanisms to aid other teams in the software ecosystem."
                    },
                    {
                        "TITLE": "Libraries",
                        "DESCRIPTION": "Spearheaded the creation and management of diverse libraries. This spectrum included white-labelled UI libraries offering thematic dynamism, custom communication protocols, and high-level abstractions for specialized car functions."
                    },
                    {
                        "TITLE": "Build Tools",
                        "DESCRIPTION": "Championed the development of enhanced extensions to the Angular CLI, fine-tuned explicitly for the idiosyncrasies of the infotainment system environment."
                    },
                    {
                        "TITLE": "Applications",
                        "DESCRIPTION": "Delivered a comprehensive suite of desktop applications, equipped with monitoring, debugging, analyzing, and testing capabilities, ensuring a smooth development and integration process."
                    },
                    {
                        "TITLE": "Extensive Documentation",
                        "DESCRIPTION": "Pioneered an advanced documentation paradigm, with features such as auto-generation and auto-deployment, underpinned by our tailored CD/CI pipeline, ensuring seamless access and updates for developers."
                    },
                    {
                        "TITLE": "Support for Other Teams",
                        "DESCRIPTION": "Established a centralized expertise hub, providing consistent support to other teams. From workshops to debugging sessions and email support, we ensured a holistic environment for knowledge sharing and problem-solving."
                    }
                ]
            },
            {
                "TITLE_PREFIX": "Educator & Collaborator:",
                "TITLE": "'Shaping the Next Tech Vanguard'",
                "DESCRIPTION": "Blending a psychological insight with technical expertise, I've ventured beyond coding. I've served as both a guide for teams and a mentor for future tech leaders, ensuring they're industry-ready with a human touch.",
                "SLIDES": [
                    {
                        "TITLE": "Benjamin Dobler",
                        "DESCRIPTION": "\"Working with Martin was more than just a professional journey; it was a human one. With top-tier tech skills paired with genuine warmth, Martin transitioned from a colleague to a genuine friend\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/richapps/",
                        "ROLE": "Project Lead Web-Development"
                    },
                    {
                        "TITLE": "Thomas Volk",
                        "DESCRIPTION": "\"A true professional with a profound understanding of the technologies used. His communication is always professional, and his approach is characterized by analytical and structured thinking.\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/thvolk/",
                        "ROLE": "Head of Engineering"
                    },
                    {
                        "TITLE": "Vladyslav Tsurkanenko",
                        "DESCRIPTION": "\"Drawing inspiration from your enthusiasm for coding, I learned to approach programming challenges with an unwavering focus. My heartfelt thanks for your enduring patience and invaluable support during my academic journey.\"",
                        "LINKEDIN_PROFILE": "https://www.linkedin.com/in/vladyslav-tsurkanenko/",
                        "ROLE": "Web Developer (former Student)"
                    }
                ]
            },
            {
                "TITLE_PREFIX": "Featured Project:",
                "TITLE": "'Revamping Spiced Academy's Digital Presence'",
                "DESCRIPTION": "I undertook a complete transformation of Spiced Academy's digital presence, emphasizing my dedication to superior design, functionality, and user experience. The platform's adaptability and consistency set new standards.",
                "SLIDES": [
                    {
                        "TITLE": "Technical Modernization",
                        "DESCRIPTION": "Transitioning from legacy tech stacks requires thorough analysis, risk mitigation, and strategic implementation. Successfully migrating from Handlebars and JQuery to a modern ensemble of NextJS, Tailwind, and GraphQL established a robust platform conducive for advanced functionalities and future scalability."
                    },
                    {
                        "TITLE": "Content Management Evolution",
                        "DESCRIPTION": "To enhance the academy's content agility and adaptability, I integrated a CMS. This empowers content administrators to dynamically adjust and update site content, fostering a consistent and updated user experience without any dependency on development cycles."
                    },
                    {
                        "TITLE": "Responsive & Scalable Design Implementation",
                        "DESCRIPTION": "Implemented a sleek responsive design that delivers a consistent user experience on all devices. This design was crafted with developers in mind, allowing for streamlined scalability and effortless future enhancements."
                    },
                    {
                        "TITLE": "Performance and SEO Optimization",
                        "DESCRIPTION": "A primary metric of a website's success is its performance and visibility. Post overhaul, meticulous optimization strategies were employed, leading to improved site responsiveness and SEO metrics. This ensures that Spiced Academy is optimally positioned in search engine rankings."
                    },
                    {
                        "TITLE": "Enhanced Developer Experience",
                        "DESCRIPTION": "Anticipating future developmental needs, the overhaul focused on enhancing the developer experience. This involved refining the coding environment, meticulous documentation, and establishing streamlined workflows, facilitating seamless future developments and feature integrations."
                    }
                ]
            }
        ]
    },
    "JOURNEY": {
        "TITLE": "Journey",
        "DESCRIPTION_LONG": "Embark on a journey through the landmarks of my career. From my earliest coding adventures to mastering advanced tech realms, see the evolution, the challenges, and the triumphs that have shaped my path.",
        "DESCRIPTION": "A professional trajectory characterized by continuous learning and adaptability",
        "STATIONS": [
            {
                "DATE": "1987",
                "EVENT": "Born in Berlin",
                "DESCRIPTION": "Born and raised in the vibrant city of Berlin, my journey began amidst its rich history and bustling streets."
            },
            {
                "DATE": "2008",
                "EVENT": "High School Graduation",
                "DESCRIPTION": "My school years revealed an early passion for numbers, science, and logical challenges. From primary school to high school, my curiosity only deepened."
            },
            {
                "DATE": "2008-2010",
                "EVENT": "Datatechnology at Siemens Professional Education",
                "DESCRIPTION": "Dived deep into the realms of computer science, exploring a spectrum of topics. This period was filled with hands-on projects, internships, and invaluable lessons that shaped my foundational understanding of the field."
            },
            {
                "DATE": "2011-2014",
                "EVENT": "Bachelor's in Psychology",
                "DESCRIPTION": "In a surprising twist, I pursued Psychology for my bachelor's degree. This journey, although seemingly off the tech track, equipped me with unique perspectives and insights that have since influenced my tech endeavors."
            },
            {
                "DATE": "2014-2017",
                "EVENT": "Masters in Human Factors",
                "DESCRIPTION": "With a thirst to bridge my knowledge in psychology and tech, I undertook the interdisciplinary \"Masters in Human Factors\" program. Here, I rejoined the tech world, blending psychological principles with engineering modules. This unique blend, fusing the human psyche with tech principles, has equipped me with a distinct edge in the software engineering realm."
            },
            {
                "DATE": "2016 - 2022",
                "EVENT": "Engineer at CARIAD SE (former Carmeq GmbH)",
                "DESCRIPTION": "This period marks my deep dive into the vast ocean of web development. Though I'd always had a touchpoint with programming, it was here that I truly embraced the world of web. As part of a core team, we built and maintained an SDK for infotainment systems in cars under renowned brands like VW, Skoda, SEAT, and MAN. More than just creating tools, we were the vital nexus supporting teams and ensuring their apps ran seamlessly."
            },
            {
                "DATE": "2022 onwards",
                "EVENT": "Freelancing Odyssey",
                "DESCRIPTION": "After half a decade at CARIAD, the siren song of varied projects and diverse technologies called out to me. Now, as a freelancer, I'm not just offering technical skills. I bring a blend of passion, dedication, and a unique perspective to every project, treating each as a personal mission."
            }
        ]
    }
}